
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 16 to add, 1 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_dashboard_grafana_managed_private_endpoint.this[&#34;dtsse-grafana&#34;]
  * azurerm_lb.pls[&#34;dtsse-grafana&#34;]
  * azurerm_lb_backend_address_pool.pls[&#34;dtsse-grafana&#34;]
  * azurerm_lb_probe.pls[&#34;dtsse-grafana&#34;]
  * azurerm_lb_rule.pls[&#34;dtsse-grafana&#34;]
  * azurerm_network_interface.nic[&#34;dtsse-grafana&#34;]
  * azurerm_network_interface_backend_address_pool_association.pls[&#34;dtsse-grafana&#34;]
  * azurerm_private_link_service.pls-service[&#34;dtsse-grafana&#34;]
  * azurerm_resource_group.rg
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.postgresql[0].azurerm_resource_group.rg[0]
* Update
  * azurerm_key_vault_secret.DB-URL[0]
* Delete
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana00&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana01&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1000&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1001&#34;]
* Replace
  * azurerm_consumption_budget_resource_group.grafana-budget-alert[0]
  * azurerm_postgresql_flexible_server_configuration.extensions[0]
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;dashboard&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_consumption_budget_resource_group.grafana-budget-alert[0] must be replaced
-/+ resource "azurerm_consumption_budget_resource_group" "grafana-budget-alert" {
      ~ etag              = "\"1dbf2406043101d\"" -> (known after apply)
      ~ id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.Consumption/budgets/grafana-budget-alert" -> (known after apply)
        name              = "grafana-budget-alert"
      ~ resource_group_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      - notification {
          - contact_emails = [] -> null
          - contact_groups = [
              - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/microsoft.insights/actionGroups/DTSSE_Alert_prod",
            ] -> null
          - contact_roles  = [] -> null
          - enabled        = true -> null
          - operator       = "GreaterThanOrEqualTo" -> null
          - threshold      = 90 -> null
          - threshold_type = "Forecasted" -> null
        }
      + notification {
          + contact_emails = []
          + contact_groups = (known after apply)
          + contact_roles  = []
          + enabled        = true
          + operator       = "GreaterThanOrEqualTo"
          + threshold      = 90
          + threshold_type = "Forecasted"
        }

      ~ time_period {
          ~ end_date   = "2035-07-01T00:00:00Z" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_dashboard_grafana_managed_private_endpoint.this["dtsse-grafana"] will be created
  + resource "azurerm_dashboard_grafana_managed_private_endpoint" "this" {
      + grafana_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.Dashboard/grafana/dtsse-grafana10-prod"
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "grafana-postgres-mpe"
      + private_link_resource_id = (known after apply)
    }

  # azurerm_key_vault_secret.DB-URL[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "DB-URL" {
        id                      = "https://dtsse-prod.vault.azure.net/secrets/db-url/f17ab232a306497d967970cbc1006d2b"
        name                    = "db-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # azurerm_lb.pls["dtsse-grafana"] will be created
  + resource "azurerm_lb" "pls" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "dtsse-grafana-prod-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "dtsse-dashboard-flexdb-data-prod"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "dtsse-grafana-lbfe-1"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/private-endpoints"
          + zones                                              = [
              + "1",
              + "2",
              + "3",
            ]
        }
    }

  # azurerm_lb_backend_address_pool.pls["dtsse-grafana"] will be created
  + resource "azurerm_lb_backend_address_pool" "pls" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "grafana-backend-pool"
      + outbound_rules            = (known after apply)
    }

  # azurerm_lb_probe.pls["dtsse-grafana"] will be created
  + resource "azurerm_lb_probe" "pls" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "grafana-health-probe"
      + number_of_probes    = 1
      + port                = 443
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # azurerm_lb_rule.pls["dtsse-grafana"] will be created
  + resource "azurerm_lb_rule" "pls" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 0
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "dtsse-grafana-lbfe-1"
      + frontend_port                  = 0
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 4
      + load_distribution              = "Default"
      + loadbalancer_id                = (known after apply)
      + name                           = "grafana-rule"
      + probe_id                       = (known after apply)
      + protocol                       = "All"
    }

  # azurerm_network_interface.nic["dtsse-grafana"] will be created
  + resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "dtsse-grafana-prod"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "dtsse-dashboard-flexdb-data-prod"
      + tags                           = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/private-endpoints"
        }
    }

  # azurerm_network_interface_backend_address_pool_association.pls["dtsse-grafana"] will be created
  + resource "azurerm_network_interface_backend_address_pool_association" "pls" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "internal"
      + network_interface_id    = (known after apply)
    }

  # azurerm_postgresql_flexible_server_configuration.extensions[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "extensions" {
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # azurerm_private_link_service.pls-service["dtsse-grafana"] will be created
  + resource "azurerm_private_link_service" "pls-service" {
      + alias                                       = (known after apply)
      + id                                          = (known after apply)
      + load_balancer_frontend_ip_configuration_ids = (known after apply)
      + location                                    = "uksouth"
      + name                                        = "dtsse-grafana-lb-pvt-link-service"
      + resource_group_name                         = "dtsse-dashboard-flexdb-data-prod"
      + tags                                        = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
      + visibility_subscription_ids                 = [
          + "*",
        ]

      + nat_ip_configuration {
          + name                       = "dtsse-grafana-1"
          + primary                    = true
          + private_ip_address_version = "IPv4"
          + subnet_id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/private-endpoints"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dtsse-prod"
      + tags     = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "DTSSE_Alert"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "dtsse-prod"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + outputs        = {
                  + actionGroupId = {
                      + type  = "string"
                      + value = "[resourceId('microsoft.insights/actionGroups', parameters('actionGroupName'))]"
                    }
                }
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.postgresql[0].data.azuread_group.db_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "db_admin" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Platform Operations SC"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.postgresql[0].data.azuread_service_principal.mi_name[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_service_principal" "mi_name" {
      + account_enabled               = (known after apply)
      + alternative_names             = (known after apply)
      + app_role_assignment_required  = (known after apply)
      + app_role_ids                  = (known after apply)
      + app_roles                     = (known after apply)
      + application_id                = (known after apply)
      + application_tenant_id         = (known after apply)
      + client_id                     = (known after apply)
      + description                   = (known after apply)
      + display_name                  = (known after apply)
      + feature_tags                  = (known after apply)
      + features                      = (known after apply)
      + homepage_url                  = (known after apply)
      + id                            = (known after apply)
      + login_url                     = (known after apply)
      + logout_url                    = (known after apply)
      + notes                         = (known after apply)
      + notification_email_addresses  = (known after apply)
      + oauth2_permission_scope_ids   = (known after apply)
      + oauth2_permission_scopes      = (known after apply)
      + object_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + preferred_single_sign_on_mode = (known after apply)
      + redirect_uris                 = (known after apply)
      + saml_metadata_url             = (known after apply)
      + saml_single_sign_on           = (known after apply)
      + service_principal_names       = (known after apply)
      + sign_in_audience              = (known after apply)
      + tags                          = (known after apply)
      + type                          = (known after apply)
    }

  # module.postgresql[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.postgresql[0].data.azurerm_subnet.pg_subnet[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "pg_subnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "postgresql"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "cft-prod-network-rg"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "cft-prod-vnet"
    }

  # module.postgresql[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_password_wo_version = 0 -> null
      + delegated_subnet_id               = (known after apply) # forces replacement
      ~ fqdn                              = "dtsse-dashboard-flexdb-prod.postgres.database.azure.com" -> (known after apply)
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply)
        name                              = "dtsse-dashboard-flexdb-prod"
      + private_dns_zone_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      ~ storage_tier                      = "P6" -> (known after apply)
        tags                              = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "production"
            "managedBy"           = "DTS Software Engineering"
        }
      - zone                              = "1" -> null
        # (14 unchanged attributes hidden)

      ~ authentication {
          ~ tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["dashboard"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/databases/dashboard" -> (known after apply)
        name      = "dashboard"
      ~ server_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana00"] will be destroyed
  # (because key ["grafana00"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      - end_ip_address   = "57.153.59.175" -> null
      - id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana00" -> null
      - name             = "grafana00" -> null
      - server_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> null
      - start_ip_address = "57.153.59.175" -> null
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana01"] will be destroyed
  # (because key ["grafana01"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      - end_ip_address   = "128.251.236.31" -> null
      - id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana01" -> null
      - name             = "grafana01" -> null
      - server_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> null
      - start_ip_address = "128.251.236.31" -> null
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1000"] will be destroyed
  # (because key ["grafana1000"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      - end_ip_address   = "131.145.83.203" -> null
      - id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana1000" -> null
      - name             = "grafana1000" -> null
      - server_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> null
      - start_ip_address = "131.145.83.203" -> null
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1001"] will be destroyed
  # (because key ["grafana1001"] is not in for_each map)
  - resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      - end_ip_address   = "85.210.36.150" -> null
      - id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod/firewallRules/grafana1001" -> null
      - name             = "grafana1001" -> null
      - server_id        = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/dtsse-dashboard-flexdb-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-prod" -> null
      - start_ip_address = "85.210.36.150" -> null
    }

  # module.postgresql[0].azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dtsse-dashboard-flexdb-data-prod"
      + tags     = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#reform-swe"
          + "environment"         = "production"
          + "managedBy"           = "DTS Software Engineering"
        }
    }

Plan: 16 to add, 1 to change, 9 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.rg has been deleted
  - resource "azurerm_resource_group" "rg" {
      - id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod" -> null
      - name       = "dtsse-prod" -> null
        tags       = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "production"
            "managedBy"           = "DTS Software Engineering"
        }
        # (2 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group has been deleted
  - resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/Microsoft.Resources/deployments/DTSSE_Alert"
        name                     = "DTSSE_Alert"
      - output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/dtsse-prod/providers/microsoft.insights/actionGroups/DTSSE_Alert_prod"
                }
            }
        ) -> null
        tags                     = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":197,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->